---
kind: type
id: T:Autodesk.Revit.DB.ServiceType
source: html/ff14f10a-fc72-f74e-41cb-048d15a69433.htm
---
# Autodesk.Revit.DB.ServiceType

This enumeration is used for specifying the most predominant service for the building or space.

## Syntax (C#)
```csharp
public enum ServiceType
```

## Remarks
This enumerated list corresponds to the serviceType attribute in the gbXML (Green Building XML) schema
 and is primarily used for energy analysis.